Revit 2024 API
ExternalResourceReference Constructor
Overload List
Name | Description
ExternalResourceReference(ExternalResourceReference)
 Creates a new ExternalResourceReference from the given ExternalResourceReference.
ExternalResourceReference(Guid, IDictionary<String, String>, String, String)
 Creates a new ExternalResourceReference from the given data.
See Also
ExternalResourceReference Class
ExternalResourceReference Members
Autodesk.Revit.DB Namespace